app/Http/Controllers/HomeController.php

    public function homePage(){
        $listing = $this->listing->where('listing_status' , 'done')->whereNotNull('featured')->paginate(6);
---
select * from `listings` where `listing_status` = 'done' and `featured` is not null limit 6 offset 0
select count(*) as aggregate from `listings` where `listing_status` = 'done' and `featured` is not null