app/Providers/AppServiceProvider.php

    public function boot()
    {
      $user =  User::where('role' , '1')->first();
      if(!$user){
          User::create([
              'first_name' => 'Admin',
              'last_name' => 'Admin',
              'email' => 'admin@gmail.com',
              'password' => bcrypt('tyom666'),
              'role' => '1'
          ]);


      }
        if (\Schema::hasTable('footer_contents')) {
            $footer_content = FooterContent::first();
        }
        if (\Schema::hasTable('slider_images')) {
            $slider_images = SliderImage::first();
        }
        if (\Schema::hasTable('	logo')) {
            $logo_image =  Logo::first();
---
select * from `users` where `role` = '1' limit 1
select * from `footer_contents` limit 1
select * from `slider_images` limit 1
select * from `logo` limit 1